import os
from dotenv import load_dotenv
from openai import OpenAI
from db import session, News

load_dotenv()
token = os.getenv("HF_TOKEN")
if token is None:
    raise ValueError("Не найден токен HF в переменной окружения HF_TOKEN")

client = OpenAI(
    base_url="https://router.huggingface.co/v1",
    api_key=token,
)


def redacter():

    news = session.query(News).filter_by(content_is_redacted=False).all()

    if not news:
        return None

    for row in news:
        try:
            completion = client.chat.completions.create(
                model="moonshotai/Kimi-K2-Instruct:novita",
                messages=[
                    {
                        "role": "user",
                        "content": f'''Ты — редактор Telegram-канала. Твоя задача: превратить любую большую новостную статью в короткий, яркий и увлекательный пост. Пост должен цеплять с первой строки, быть простым для чтения и интриговать подписчиков.

                Правила:

                Заголовок новости: обязательно включай заголовок в пост. Его можно легко редактировать и стилизовать, чтобы он был более цепляющим и интригующим, но смысл новости сохраняется.

                Эмодзи в начале: подбирай подходящий эмодзи под тему новости. Если подходящего нет — используй 💮.

                Структура: обязательно разбивай информацию на буллеты (➖ или •), каждая мысль — отдельная строка.

                Стиль: разговорный, живой, эмоциональный. Можно добавлять лёгкий юмор, мемные или неожиданные сравнения.

                Информация: только самое важное и интересное, легко усваиваемое. Включай даты, цифры, характеристики, рейтинги.

                Заключение: короткий финальный пункт — интрига, юмор или вызов к действию.

                Язык: простой, дружеский, как будто рассказываешь друзьям.

                Формат результата:

                [Эмодзи] [Заголовок новости (можно стилизовать)]

                • [Самый яркий факт 1; цифры, характеристики, дата]
                • [Самый яркий факт 2; цифры, характеристики, дата]
                • [Самый яркий факт 3…]
                • [Заключение: интрига, юмор, вызов к действию]

                Пример:
                🎮 Valve показала новую консоль!

                • Работает на SteamOS, поддерживает 4К и 60 FPS;
                • Размер — маленький кубик 16 см;
                • Две модели — 512 ГБ и 2 ТБ, с возможностью расширения через microSD;
                • Релиз — начало 2026 года.

            Заголовок:
            {row.title}
                
            Статья:
            {row.content}
            '''
                    }
                ],) 

            row.post_content = completion.choices[0].message.content #type:ignore
            row.content_is_redacted = True #type:ignore
        except Exception:
            session.rollback()
            return Exception
        finally:
            print(f"Пост с id {row.id} обработан")
            session.commit()
    return "corect"